{"transcript-id":{"0":"1"},"title":{"0":"Digest of Decisions and Announcements and Important Speeches - Period 2nd October 1941 to 12th August 1942"},"prime-minister":{"0":"Curtin, John"},"period-of-service":{"0":"19411007 - 19450705"},"release-date":{"0":"02\/10\/1941"},"release-type":{"0":"Speech"},"document":{"0":"https:\/\/pmtranscripts.pmc.gov.au\/sites\/default\/files\/original\/00000001_3.pdf"},"subjects":{"0":null},"content":{"0":"COMMONWEALTH GOVERNMENT.DIGEST OF DECISIONSAND ANNOUNCEMENTS ANDIMPORTANT SPEECHESTHE PRIME MINISTER( THE RIGHT HON. JOHN'CURTIN).INDEX.FERIOD-2z\" OCTOBER, 1941, TO 12TH AUGUST, 1942.Bh Authornav:L F. Josomi. Coimonwealth Coammi Natei. Cambim( Printed inA, ustrali0.6404. INDEX. ISSUE. PAo.Abboo Bread Co 4Advisory War Council 1 3Co-operation of Opposition 12Aid to Russia-Roling stock to Iran 1Use of Australian troops 1 1Prime Minister's statement 3 11Shipping position 4 13Aircraft Production 2 11PPrroogdruecstsi orne voief wsteede ls 33 22Unauthorized report 5 13Shock absorbers manufactured 7 7Inquiry into finances 8Cotton fabric for planes 8Australian made bomb sights 9 21Air Screws 9 21Australian designed riveting gun 10 isAustralian made bomb racks 10Control of private productionEDmivipdleody mceonntt roolf rweommoevne d .12 12 11122..Gipsy major engines 12 12Dopartment's functions 14 13Appointments made 14 14Purchase of bomber 14 14Commonwealth Aircraft Corporation 15 16Advisory committee's work 15 16Railwaymen needed 15 16Expansion plans announced 17 16Production of parts 17 16Beaufort bomber schedule 19 12Australian magneto 24 17Airgraph service 4Air raid precautions-Blackout provisions 2Compensation payments to workers 6 410 t118 435 636 19Arrangements with States 7Respirators for civil population. 10 12 11Bulk oil installations 12Commonwealth establishments 11 12Supply of steel helmets .12 121Sales Tax remissions 14 23Review of lighting contracts 15 1118 1isoPremiers Conference 1.. 17 6Icnirbob 26 21Stirrup Pumps 18 3IAni cernadidia rshy ebltoemrsn bs 2108 33Types of shelters.. 22 14Jervis Bay territory 22 14 3Iwnux---e inued. Issus. PaonAir raid precautions-cotinued.Compulsory duties for male adults 24 21Brown-out modified 28 24Equipment supplies 29 22S.. 34 14Exemption for personnel 29 22Construction permit 32 24Conference on protective measures 34 14Camouflage restrictions 35 8Alcoholic liquor-Illicit drinking 20Cut in beer production and sale 22 333 635 15Sales in the Australian Capital Territory 22 3Prime Minister's statement 22 3Relief from hardship 22 4Reduction of licensing hours 24 22Advertising restricted 2266 .. 4d 27 22Stsat'r espo sibiliRtoy vl 27 2235 14Report y ustoms MiUts ter 31 12 4Aluminium-Man facture in Australia 6 18MP.. 25 17Scrapd r esqubir edP m i tr.. 12 13Visting prohibited 15 24Amalgamated Wireless ( A'sia.) Ltd.-Vacany on Board filled 23America, relations with-Message from President Roosevelt 1 18New York Officer 3 13Demand for Australian news 6 16Message to United States 10 23Radio telegraph service 12 24hing of do rcaurrr ency g 0 16undd in AustraliaMessage to Philippines 20Broadcastb by Primue MHinister .2o 9Visit of Dr. Evatt M ietU e 22 21ndpn ne.. 31AutSePm w 32Australian Minister relinquishes Cosition 24 17New Australian Minister 0RUenlietaesde Sotfa tne s forces-1wasn. d crima inal chsa rges 2309 21Dayto -lFlag c t e 30BVMisaict Aorf tAhuusrt rDaaliyan Cabinet Minister to United States 333 20Independence Day 33AppAlceqsu iasnitdio pne aSrcs-h-e-mese --ayPmyeentts . to.. r31e222ogoes 19-Parliamentary Committee's report 4 17-Loss on 1941 crop 9 9Crown Law Department inquiries 9 9-1942 plan 10-1942 payments .20 6-Plan to continue .36 16Board reconstructed 13 8!Retail price control 31 22Free supply to forces 31 22 C-! 4InnX-oontisudf.Argentina-Australian RepresentationArmistice DayArmy Inventions Board-Minister orders inquiryNew position explainedMinister to reviewDirectorate createdChief Executive Officer appointedSubmissions receivedArmy Police Force-Attorney-General's statementArmy Minister's statementAustralia First Movement~Members internedSummnonses servedProsecution against membersInternment and appealsAustralia House--Agent-General's complaintAustralian Broadcasting Act-Bill before ParliamentStanding Committee appointed.Australian Broadcasting Commission-Extension of termAppointments madeAustralian Defences-Re-organization surveySir Iven Mackay's reportCommand changeAppointments from A. I. P.Australian food suppliesAustralian Imperial Force--Air support forChristmas parcelsDarwin leave arrangementsDancin NewesDiet in MalayaMalaya war correspondentPrivileges at DarwinArmoured divisionNo recall ofEquipment at hospitalsConditions at DarwinAwards for gallantry-ISSUE. 9 3. 2 8.17 25 6 52426 29 31 7.27 32 32 7.12 13 26. 714 2 32. 3 3. 4. 7.4 4. 7. 9.12 13 1921 29 32 PAGE. 8l0 21 7is12 72418231112 2323 1721 14 1416 23 1623 17 21 16 Australian Imperial Force--continued.Mails to troopsSouvenir BookChristmas leaveUnified bodyChanges in drillAge groups' suitability..Singapore censorshipReserved occupationsGerman propagandaR. M. C. graduatesBody armour testsMiddle East reinforcementsReserve formedLanding in TimerMail censorshipNot in action in MalayaDischarges to join Indian Army..Returned soldiers' badgesNew brigadiersMails to MalayaReport on DesertersReturn to AustraliaAwards for servicePersonnel in Java, Amboina, TimorUse of colour patchesnTAr.. M. Blain, missing\" Australia\" shoulder badgePrisoners in JavaPersonnel missing in MalayaAction in EgyptRe-enlistment in Australian Military ForcesAustralian Military Force&amp;--Leave for rural workersArmy Minister's statementLabor Minister's statementElimination of extravagance in campsChristmas leaveUniversity students' trainingCommonwealth employeesEquipment shortageTemperance deputationStrategic roadsGleadall bombGleadall land mineNo export of riflesMilitia enlistments in Australian Imperial ForceChristmas dinnerUse of Militia overseasExemptions from serviceSeaside areas..Partial mobilizationNew classes 6 6.. 7 7..7 917 9..12 12 1213 14 15 15 19 1923 28 24 28 28 29 29 32 34 32 33 34 35 2.27 2. 3'. 5 10 8 8.10 31 10 10 28 33.35 10 10 10 1011 11 PA03. 14 14 18 24 12 12 12 13 17 14 14 889 669913 13 17 89771111 16 11 16 11 13 84 881824 419 22 3324 3 323 14 8344 29 6INrn-coninued.Auitralian Military Forces--contisued.Command changeCentral Australia transportAppointments from A. LFBilleting of troopsReserved occupationsImpressment of riflesCall-up of doctorsDarwin victuallingLiquor in campsEnlistment of aliensSir Iven Mackay's commandEducation serviceFree rail reservationAccountancy advisory panelPromotions Hospital accommodationMilitary service for aliensRelease to pick fruitAmbulance trainsWar service moratoriumDarwin administrationFurther call-upOfficial war artistCommando unitsHead-quarters staffAssistant-Secretary for suppliesTraining in offensive tacticsUse of Rising-Sun badgeTrawler fired onComforts funds officers....Re-organization of Australian armyPowers in place of Military BoardFull war strengthChange in dietFree postage serviceX-ray examination of forcesDirector-general of Medical ServicesDirector-general of Public RelationsConscientious objectorsRecognition of aircraftSpecial Australian medalse in war theatresGeneral MacAthur's commandPreventing dengue feverState of defencesFinancial powers to commandersRoyal Military CollegeRelease to Royal Australian Air'ForceAutomatic rifleGifts for national defence ISSUE. 12 15 12 12 13 14 12 13 13 1314 14 22 14 21 14 14 15 1520 1515 15 17 17 17 17 17 18 19 19 25 19 19 21 21 21~ 2424 35 24 24 24 24 24 24 .2527 34 25 25 27 27 27 28 29 30 33 30 33 30 30 PAGE. 14 14 14 4 714 3 7818 811 8866 66719 19 11 23 12 13 13 443 666 6 723-9 1223 24 6.9 S9 23 13 813 8314 14 7llrDEX-COstinmd.Australian Military Forces--continued.British battle dress not to be usedAir mail letter-card serviceSaluting Powers of sentriesDirector of AmenitiesProfessional sport and work on leaveBusiness adviser appointedSenior cadet corpsAllied salvageService representation abroadAustralia-United States staff appointmentsService for personnel under twentyAustralian troops, use ofAustralian war effort and capacity-Production executiveProduction executive meetingSurvey of raw materialsProduction Planning BoardAppointmuents madeScientists Changes in department.Establishment of industries committeesScientific resources surveyProduction executive committeeLiaison officer appointedDeputy Directors nppointedProhibition of manufacture of non-essential commodities 31 33 33 33 34.34 34 3535 35 36 19-7--9-10 10 15 15 17 1627 3.3 17 17 1925 28 30 19 1925 28Prohibition of cosmetics 24Control of retail deliveriesRationalization of bread industry 27.1 32Consumer rationing-Minister's announcement 28-Prime Minister's statement 28-Effect on lay-bys 28Changes in schedule 28-Regulations announced 28-Articles excluded-Advertising 32 32-Retailers' quotaSupplies to patriotic bodies 32Soldiers' clothing 32.-Restriction order withdrawn 32Schedule of goods 32-New deputy-director 32Compulsory manufacture 32-Returns of stocks 33-Ration books for troops 33-Royal Australian Air Force andWomen'sAuxiliary Australian Air Force 34-Industrial and rural scales 35ISB. PAON. 8IND x-continued. ISSUE. PAGLAustralian war effort and capacity-continued.Review of war commitments-Man-power 30 4.33 11( Dairyindustry).. 33 12S-34 836 21Laundry and dry-cleaning industries 33 12Australian Clothing Council 34 9Public donations 35 8Simplification of clothing 35 -8War Organization of Industry defended by Prime Minister. 35Small businesses 35Control of bathing costumes 36 22Ban on commercial travellers ( South Australia) 36 23Australian War Memorial 21Bank Board, Commonwealth-Director retires 1 24Conference held 1 24Further conference held 3 2235 18Meeting with private banks 4 8Conference with private banks 5Appointment to board 5Banking Control-War-time Regulations 8 19Concentration of banking to release man-power 20 1924 17S 24 2432 21Further regulations 21 22Closing hours of banks 27Exemption extended 35 8Barley pool-Further advance made 4 13Representation on Board 5 81941-42 Crop Advance.. 10 T1126 3Appointment to Board.. 17 23Acreage restriction 24 23Bennett. Major-General H. 0.-Visit to Middle East.. 4 16Prime Minister's statement 20 18Appointment as acting inspector-general 21 23Report on Malayan campaign 24 22Blackwell, Mr. Leslie, M. P.-Visit to Australia 3 14Arrival in Australia 5 12Visit to be returned 9 8Blarney, General Sir Thomas-Visit to Australia 4Discussions in Australia 5Return to Miidle East 8 13Return to Australia' 24 9Prime Minister's statement 33 18Books, banning of 4 9Army Minister's statement 8 3Mr. A. Cameron, 8 4Russian newspapers 8Censorship control 8Boer War pensions 1 11 C 9INDzX-Contflued.Britain-I! rime Minister's message toBroadcast by Australian Prime MinisterAustralian representationBritish Broadcasting Corporation-Prime Minister's criticismCable' to British Prime Minister.British Commonwealth of Nations-' Prime Minister's statementBritish Prime Minister-Message fromBudget, I941-42-Invalid and old-age pensionsSummary by Prime MinisterSpeech by Prime MinisterTreasurer's statement on credit.Telephone charges increasedPostage rates increasedNew issue of stamps.Excise on brewery productsSupplementary statementSpecial war taxesSupplementary expenditureSummary of year's transactions..Builgaria, war with-Proclamation Minister's statementBurma, Prime Minister ofButter, marketing of-First grade butterRationing not proposedCanada-Hieh Commissioner arrivesMessage to AustraliaGift from Canadian womenCanberra, Departments atPlan for new officesGovernment's activitiesCensorship branchSocial Service Department returnedDepartment of InformationCapital Issues--Board appointedReguiations amendedRestrictions on mortgagesBuilding controlCasey, the Right Honorable R. G.-White PaperPosition relinquishedCash Orders and Hire Purchase-Report by Board of InquiryRegulations gazettedRegulations amendedCasualties, War-Losses of Empire troopsAustralian ForcesA. I. F. lossesAustralian Imperial Force in Malaya and MidCensorship-Committee appointedChapman, Dr. James Issuz. .3..28 27 31 1623 36 28-3. 4. 0.8 8.11 31.34 1515 4.34 1422 22 8.12 14 17 12 26 32.34.23 2423.30 3.Idle East 22 24 5 PAOU. 17 11 21 18 1124 319 67822 22 913 13 11 912 1721 21 1324 1323 022 1324 24 1213 17 322 22 724 S. Child endowment-Payment to widowed motherMembers of permanent forcesBill before ParliamentPayment to repatriated childrenChina-Australian relationsAdmission of nationals..Nationals in AustraliaPart in Pacific warChinese liaison officers in AustraliaPrime Minister's tributeChristmas cardsChristmas leaveCivil Aviation-Director-General re-appointedCoal Mining Industry-O III OU.. LI.Boards of referenceConference to be heldPolicy regarding Coal CommissionDisallowance of Statutory RulesConference with minersShortage of laborConference abandonedStrike deploredStrike arbitratorPrime Minister's appealWallarah strike settled..Regulations alteredAcquisition of stocksCommission appointed..Western Australian minersProduction hamperedPrime Minister's actionRegulations promulgatedPrime Minister's statementCommission's powersConferences heldPrime Minister criticizes New South Wales miners..War Cabinet decisionDuty of ownersNew Coal Control RegulationsLabour Minister's statementEmployees requiredMiners returned to industryStatement to ParliamentStatutory Rule 168Committee of inquiry proposedCause of stoppagesConference&amp; with minersConference' with ownersCoal ConferenceSupport for agreementPrime Minister confers with minersNew regulationsRight to strikeIdle colliery---question of prosecution-Prosecutions issued 2 227 35 723 23 28 33 7..36 4..35 3.18.5. 567-7..7. 10 10 10 12 14 14 1414. 1818 25.25 25*. 25 25 27 27 30 27 29.29 29 29 29 29 30 32.34 34 35 35 36 PAGN. 9922 612 1222 617 19 19 13 88 8914 14 7 8914 11 788 88912 1916 47788819 3.17 18 16 17 11INDEX-continued.Commonwealth Bank Board-Director retiresConference heldFurther conference heldMeeting with private banksConference with private banksAppointment to BoardCommonwealth Grants CommissionCommonwealth Officers' right.Company Law-Uniform legirJationConscription-Prime Minister's statement.Propaganda by enemyCooper, Mr. Duffeeting with War CouncilAppointed British Minister at Singapore..Appointment terminated\" Cost-plus inquiry-Minister appointedNew system of costingMachine tool hiring ratesMinister's statementDaylight Saving-Commencement DateDiscontinuance announced1942-43--Cabinet to considerCommencement dateDenmark-Position of consul in AustraliaDepartments at CanberraPlans for new officesGovernment's activitiesCensorship branchSocial Services Department returnedDepartment of InformationDutch Hospital ShipEastern Supply Council-Minister to reportSir Bertram StevensEconomist Egg ContractEmpire Air Service-Government assumes controlMiddle East and United KingdomTemporary suspensionFlying-boat shot downPartial restorationCorrespondence to Netherlands East IndiesAircrsft in mishapEnemy Aliens-Education of interned childrenProperty regulations alteredLand transfer regulationsMilitary servi Curfew imposedEmployment by Works Council ISSUB. Isss 335 44 8.0 1.0 6.27.0 9.7 2.9512 14 12 17o 20 oø27 34oo 36 12 1 527 12 1417 12 a3 22 812 412 15 17 17 17 19 24 10 1032 10 1519 35 PAGIL. 24 24 22 18 821 1121 19 14 19 1111 24 24 623 1621 1423 12 13 24 13 23 91724 23 18 13 17 812 13 1324 24 9 922 713 16 INzx-coufmud.Enrolment of electorsEvacuation-War Council decisionExternal CommunicationsRadio telephone servicesPress telegramsRadio telegraph servicesService with Fllinders IslandPhototelegram serviceAustralia and IndiaTransmission of picturesCables to United States of AmericaFar Eastern Position-Statement by Prime MinisterCohesion in PacificReply to Rear-Admiral LuetzowPrime Minister's statementDangers to AustraliaExternal Affairs statementAustralian station of warWar. Cabinet meetingFighting Forces-Postal voting byBodies ofPostage ratesPassages for wives Of members married abroadInvalided members. Financiai News-Criticism answeredFinland, Hungary, Rumani-War withFlax Industry-Bonus paymentTasmanian millsAppeal for plantingConditions for 1942Food supplies, AustralianFostars Shoes Pty. Ltd.France-Australian relations with Vichy GovernmentGold mining-Continuance of industryMinister's statementStatement to ParliamentTaxation Man-power decisionsGrant for mines closed.New South Wales and Queensland mines.., Government, the newAdministration Assistant Minister for the Army.Assistant Minister for MunitionsMembers of Parliament to assist MinistersTitle of portfolio alteredPolicy-reply to Opposition LeaderPolicy-banking SUNr. 217 2.13 19 1314 27 14 1614 20 20 23 31 2. 2. 3. 4. 7. 9.12 9.10 9.15.24 35 36 3.10 2.3.21.26 2 6..27 .20. 28 28 32 33.34 19 2019 2021 2125 31 PAGE. 17 716 23 16 14 14 .31212 924 3 41s 736 7it24 91821 18 24 is is 24 3 9819 13 21 13 14 21 14 3416 7 3717 624 2223 7 IniDx--conin~ ued. Issuxt.Governor-General-Extension of termGrants CommissionGraving dockGreeco-Primo Miniater's messageGreek Migrants--Policy modifiedHealth and youth welfare-National Medical ServicesNational Fitness CouncilTuberculosis patientsExamination of school childrenShortage of doctorsDeputation to MinisterEmployment of alien doetorsNational Fitness CampaignMedical practitionersVenereal dise~. eHlides-Imports Hide and Leather Industries BoardReguiations amendedMr. J. S. Rosevear, MP., appointed controllerHire Purchase and Cash Orders-Report by Board of InquiryRegulations gazettedRegulations amendedHonours Housing-Minister to call conferenceMunition workersWar Workers' Housing Trust 35 2. 4.24 12 24 7. 713 8.12 19 27 19 27 35 4.22.34 3523 30 13 32 PAON. 12 21 is 916 16 91721 24 12 23 16 12 21 24 23 310 19 81 16I 199 23imports-Restrictions on sterling goodsLicences suspended .13Licences varied 33Incomes, am Australian-Committee to reportCommittee's report adopted .7Income Tax-Report of Parliamentary Committee .8Special war taxes 11Instalment deductions.. 12Appointment of second commissioner .25Uniform taxation-Committee to report-Premiers' Conference. 26-Constitutional power .28-Bills before Parliament 29-Compensation to Western Australia andTasmania-High Court case .32-Rates for 1942-43 Budget 32-Legislation held valid.. 341P -States' rights 34Deductions fforrA ir-SRuasipde nPsrioecna uotifo ntesr reitxopreyn dtaitxuerse 2364 14INDZX-Continued.Income Tax--coninued.Concession to metalliferous mining industryAlimony and maintenanceProfessional men on war service..Industrial-Minist6r states policyOfficer to DarwinArbitration systemSmall arms factoryAvenues for representationsConciliation machinery..Dilution of laborSmokes For defence workeDilution of Labour CommitteesTrades Union Advisory PanelIrritation tacticsCo-operation by UnionsPrime Minister to UnionsNumber of strikesPreference to unionists..Man-power advisory committeesHolidays t iEmployment of women ISSUB. 28 32 34 34 1 12. 7.2. 3. 6.29 3134 3. 4 5. 5 6. 7 7. 7 9.11 12 13 1429 33 22Late shopping 1Conciliation regulations 12Conference--Industrial Relations Council 13Council personnel 14Council sittings cease 15Strikes must cease 15Road Transport Workers' Union 15Members of Parliament to assist Minister 19Port Kembla dispute 19Work lost in military service 19Statutory Rule No. 77 22: 23Week-end break 22Liaison officer to trades unions 22Employment of woiden telephonists 25Prime Minister meets Australian Council of Trade Unions 27Trades union conference 27 29Payment to disemploycd persons 2711.. 34Medical equipment in establishments 3333Lighting in factories 34Apprentices 34Technical training 3514 PAGo. 6721' 23 14 14 14 14 14 14 18 14 11 17 9612 11 421 11 9i6 16 17 18 13 3 618 13 313 6 914 19 17 1717 334418 64413 4444413 ID EX-ConliLued.Information, Department of-Relaxing censorshipEffect savingsObiference with pressPress cables reducedServices to Forces, Press, PublicReduction in expenditureRumors discountedCensorship branch in CanberraResignation of directorRe-organization arrangementsCentral office at CanberraAustralian news serviceReport on activities.Inaurance legislationInternational Labour Organization-Report of Australian delegationInternational Wheat Agreement-Conference at WashingtonApproval by GovernmentsItalian propaganda-Statement by Prime MinisterJapan, War with-Prime Minister's statementProclamation of warPrime Minister's broadcastState of warMessage to United StatesParliament approvesExternal affairs statementFirst attack on Australian territorySwiss consulate to actAction in MalayaRaid on Port Moresby..Message to SingaporeCasualties in MalayaJapanese landings in New BritainSingapore positionAction at AmbonFall of SingaporeAustralian Imperial Force in SingaporeAttack on Darwin ( first raid)( second raid)( third raid)( fourth raid)..( fifth raid)( sixth raid)( seventh and eighth raids)( ninth to eleventh raids)( twelfth raid)( thirteenth raid)( fourteenth raid)( fifteenth raid)( sixteenth to eighteenth raids)( nineteenth raid)( twentieth to twenty-sixth raids)Attack on Darwin, first raid, rumoursAttack on Darwin, first raid, report by judgeAttack on Broome and WyndhamLanding in New GuineaCommand at CeylonUse of Allied soldiers ISSUR. 10 12 110 12 1415 17 19 3131 I33 PAO f.12 12 13 13 17 16 1324 21 9671723 12 17 1710 1810 is10 1810 2310 2310 2412 13 2413 2415 917 17 2117 2117 2219 819 619 719 719 720 2121 421 22 1722 1824 724 825 325 326 2426 2431 1732 2336 320 2121 424 820 21 421 22 14 16INDZX-cninued. IssuE. PAGE.Japan, War with-continued.General Douglas MacArthur .22 14 3-War Council Meeting\" 24 7Aid from United States 22Attack on Broome ( second raid) 22 18Attack on Derby ( first raid) 22 i8Attack on Katherine ( first raid).. 22 18Attack on Wyndham ( second raid) 22 18Air Minister's review 25 3Attack on Born Island ( first and second raids) 28 3( third raid) 34 3( fourth and fifth rids) 36 4Fall of Corregidor 28 3Naval engagement-Coral Sea 28 4Darwin hospital staff 28 6Prime Minister's war conference.. 30 22Attack on Sydney-Submarine raid 30 22-Shelling 30 24Attack on Newcastle-Shelling 30 24Submarine attack on shipping 30 2331 176.. 3 4Prime Minister's statement to Parliament 31 16*-Exchange of civilians 34 3Further Japanese landings in Papua 34 3Allied offensive 35 1436 4-Supplies 36-Attack on Solomons 36Attack on Townsville ( first to third raids) 3Attack on Mossman ( Queensland) 36 4Attack on Port Hedland 36 4Japanese propaganda-Reply by Prime Minister 15Australia to counter 21 3Judiciary-Diplomatic Representation bill 28 13Latham, Sir John-Proceeding to Australia 5 llArrival in Australia 7 3League of Nations-Australia's contribution 9Lease-Lend Negotiations-Prime Minster's statement 8 12Australian representative 13 4Preliminary agreement... 20 11United States representative in Australia 22 13Allied Supply Council 22 1324 2328 aStatements in Press; 33Reciprocal aid to United States forces 33 11Liberty Loan-Terms announced 18 4Prime Minister's speech 18 4Payment of interest 20 21Over subscription announced 20 21Total subscription 24 4I: Liberty Loan, Second-Terms announcedPrime Minister's opening speechPrime Minister's statementPrime Minister's broadcastOver-subscription announcedTotal subscriptionLiterary Censorship Board-Members rn-appointed..Loan Bill-Appropriation of L75,000.000Appropriation of œ 100,000,000Loan Council-Reduction in programmesFurther reduction in programmesLoan, War and Conversion-Prime Minister's speechSuccessful'operationMan-power-Army Minister's statementRegulations approvedDirector-general appointedAppointments madeDismissal for serious misconductNational registerReserved occupationsEnlistments in Voluntary Defence CorpsEngagement of labourCommittee chairman--State committees of adviceReview by Cabinet sub-committeeRural industriesExemption of working principalsTraining of techniciansPowers of National Service OfficersMaterials for War-Why savings are neededDiversion of resourcesStandard of livingCurtailment of civil goodsOrganization of industryLuxury advertisingCotton yarn stocksCotton imports restrictedNon-essential industriesCbristmss spendingEssentials for defence.Wastage of paperGoods \" frozenCommodities controlledMotor vehicle spare partsCongestion at wharves..Wattle bark INDFIX-eontinued. ISSUE. 29 31 32 32 32 32'30 2031 PAGE. 22 3913 14 S.2317. 2236 24.3.15 15 17 21 2121 2123 24 23 24 2925 27 31 27 32 1..2.-9. 12 13 1314 17 36 14 18irDxx-continued.Materials for War-codinued.Restriction on use of rubberProduction of mineralsRestrictions on paper wrapping..Supplies of vegetablesExports prohibitedMotor cycle spare partsTents requisitionedTomato ban liftedDirectorate of Defence Foodstuffs\"Defence Foodstuffs State CommitteesAluminium scrap \" declared\"School uniformsJute goods controlledAustralian Food Council-Copper control and pricesRestrictions on cellophaneUse of elastic restrictedDehydration programmesRubber conservationStandardization of clothCopra poolLeather goods controlledPaper d'oyleys prohibitedRegulation of bicycle covers and tubesMaternity Allowance-Bill before Parliament..Meat Agreement-Modification of termsFrozen and canned meatsSome restrictions liftedCanning of various classesNew control systemLamb pricesMercantile Marine-Concession faresSeamen captured by enemyRegulations announcedCommission establishedMigration, Chief OfficerMortgage Bank-Conference discusses proposalsDiscussions at Agricultural CouncilLegislation to be preparedMunitions contracts-Method of payinentMinister to inquireAllocation of plantBren gun carriersVillawood explosives factoriesLaunceston railway annexe. Refunds to Government ISSUE. 17 23 30 1717 1717 21 31 34 3619 19 2021 22 23 25ø. 26 26 28 34 35 29 32 32 33 33 33 3335 35 36 27 3.14 15 28 1931 33 9..13 13 13 7.36 2. 4.5. 8.. PAB. 17 91817 18 18 19 16 17 11 61723 24 1622 9723 23 22 18 722 24 24 24 14 2122 i8 222D 19 7923 23 S22 23 9813 13 11 722 7 Munitions missionMunitions production-Holiday arrangements.Master plan ' neededUse of machine toolsNitric acid and MethanolTank manufactureChristmas arrangementsControl of forgingsCheck on enlistmentsRevised programmeInstrument fitters neededSecretary of DepartmentHampering activitiesSpeed-up of outputEmployment of womenMeal service for workersDirector of armored fighting vehicle productionGas masks regulations.Control of hand toolsAustralian-made bombsPowers of Director-GeneralMunitions, Supply and-Definitions of functionsMr. D. J. Nolan's dutiesNational Economic Plan-Prime Minister's announcementRegulations announcedTreasurer's statementSales and transfers of landParliamentary committee appointedSale of house propertyPrime Minister's statementReport of Parliamentary committeeInterest rates on unsecured loans and depositsFixation of wages and salariesCost-of-living changesBasic wage adjustmentsProfit limitation-Prime Ministers' announcement..-Regulations announced-Parliamentary Committee's reportGovernment's policy-Rebate proposal-25,000 capital-Averaging profits and lossesShareholders' funds-Plan abandonedAdjustment of rates of payHearing of wages claimsNational Oil Pty. Ltd.-Investigation by MinisterMinister confers with General ManagerProgress of discussions.Cabinet sub-committee appointedCompany reconstructedNational Savings Campaign-Treasurer's announcementBroadcast by Prime MinisterNationality of Women-Australian Women marrying Americans ISSUE. 2. 9.8. 8.10 13 13 13 16 2125 25 25 26 34 34 2 5.18 18 1818 20 20 20 20 22 23 28 31 18 18.20 33.34 34.34 35 35 33.35 2. 4. a.9.1225 25 24 PAGE. 16 2321 19 21 7888416. 16 3-317 1121 21 24 18. 1614 1723 24 1314 14 7.18 24 1114 19 416 16 422 41s23 12 13 IwDzx:-c1Vinued.Netherlands~ Australian Minister appointedMessage to Netherlands GovernmentArrival of Netherlands Minister.Netherlands East Indies-Trade Delegation arrivesExchange of representativesPrime Minister sees DelegationDr. H. J. van Mook's visitGallant fight praisedAustralian consul-generalArrival of Government officialsNewcastle floating dockNew Guinea-Capital ofEntry into uncontrolled areasNewsprint rationing-No further reductionAdjustments to operateFurther reductionsNewspaper proprietor's licenceNew Zealand-Visit of Honorable W. NashHides import planMission to AustraliaClose consultationsVisit of New Zealand Prime MinisterNion-official Postmasters-Inquiry into remunerationRemuneration increasedNorthern Territory-Policy for aboriginesDarwin port superintendentEvacuation of civilians-Overseas Air Mails-Use of Dutch servicesOwen sfub-machine gunExperiment on Bren gunPlans to BritainRequest by Canadian GvrmnModifications in design..Payment of royaltiesConference on productionAmmunition importedNumber manufacturedSpeed-up of productionGift to army.Mass productionTaciflo ( ace Far-REastern).Page, Sir Earle, M. P.Status in Great BritainParliament-Sittings ISSUE. 2323 26\" 4. 7.14 1717 21 I. 2. 8. 3.20.24 32 2. 3.420 23 35 PAGEU. 3334 912 19 19 2123 712 23 13 is21 1224 24 177 1636 231 1619 421 213. 4. 4. 7. 7. 7. 8.29 38 2.1419 21.24 31 Parliamentary CommitteesRepatriation CommitteeBroadcasting CommitteePassport applicationsPensions, invalid and old-ag. e-Labor party decisionPensioners in employmentMinister's statementBill before ParliamentCost of living increasePensions, Widows'-Bill lIefore Parliament.Cost of living increasePeople's ArmyArmy Minister's statementrime Minister's statementPetrol supplies-Statement on tankersNew fuels'soughtMinister's statementNational Oil Pty. Ltd.Rationing systemBuilding tsp reserve stocksRanney-Fairbanks reportPower alcohol distilleriesPetrol for bo okmakers.Lakes Entrance fieldPetroleum Oil Search BillEmergency restrictionsRation licences cancelledConservation of ration.Producer gas unitsPrivate motorists' dutyControl in emergencyRe-assessment of licencesPool of brands formed.Pomeroy bullet.Portuguese Timor-Australian representationJapanese propaganda answered.Premiers, State-ConferenceSpecial powersPull co-operation givenConference with General MacArthusrSunday entertainment for forcesLand for defence purposesRegulation 35AFiuture confcrences ISSUEs. 31 32 710.24 27 3629 36 17 17 2. 4. 6.9.12 3.5 6. 7..34 7.8.11-12 12 14 18 32 1418 is 32 35 4. 7. 9.20 11 17 26.34. 11 1926 26 26 26 26Twnur--continued FAUB. 13 322 24 17 9 923 24 22 23 23 22 41823 1114 22 14 24 2318 9 623 924 17 9J0 23 18 916 S3 361924 12 23 19 22INrUx-coe* inudPrice&amp;--Pcs-Isauu. PAGE.Goods \" declared\" 3 712 15 1619 623 1125 632' 2433 2236 13Suspension of order 3 16Suspension Order removed 9 24Firms\" deolared\" 6 147 21-22 310 1614 1919 623 1125 730 2036 14Increase in petrol 6 14Price of butter .7 21Premier of Victoria .7 9 241Premiers' Conference to discuss 7 21Car insurance rates 17 13Anti-profiteering regulations 19New system of control 25 7Prices Commissioner-Assistant Commissioner 2Prime Minister's statement 7Customs Minister's statement 5 917Administration changes discussed 5 9Appeal Tribunal proposal 7 18Power to control profits 36Defended by Prime Minister-Inquiry offered 36Inquiry not desired 36 12Primary industries-Minister states policy 1ICattle tick eradication 2Agricultural Council meeting 8 6Pm decisions 8 7Prime Minister's statement 12 7Poultry farmers' position 12 11Canned fruits.. 14 18Tobacco Board reconstituted 14 19Acquisition of field peas 1725 24Members of Parliament to assist Minister.. 20 17Stock Dispersal Committee 20 1727 3Dispersal of stock 22 1927 3Production of fodder' 22 19Wheat for stock feed 22 1930 21Werribcobeef 24 2329 4Vegetable seeds committee .25 24Vegetable seeds stocks \" declared\" 27 3Potato committee 27 3 23 ISSUE. PAGN.Primary Industnies-continued.Guaranteed price for potatoes 29 4Sugarocrop 31 9Dairy industry 36 24Prisoners of war-Assistance to Australians 1 23Air mail rates reduced 1 23Conditions of employment 1 24 214 8Co-operationlfom Relatives 4 8Australians in North Africa 13Number in AustraliaRed Cross facilities 10Letters censored 13 17Information in letters 15Japan to exchange news 15Use infruit industry 15 16Op. 17 4Food relief to allied prisoners 23Japan withholds information 26 22Examining commission 26 22Japanese treatment 28 14Number employed in Australia 28Letters from Australia 29 21Escape from Australian camp 29 21Letters to Australians in Japanese hands.. 33 6.36. 16Production executive-,Prime Minister's statement 2 236. 3Functions of S 4First meeting 6 18Survey of raw materials 7 13Committee announced. 17 3Two Ministers appointed. 19 16Badiophysics School 3 s1Ratliff and Thomas 2 4Reconstruction-Prime Minister's statement 28 1230 3Cabinet sub-committee appointed 36 14Recruiting for Services-Conference to be held 2 17Ministers to confer 3Reinforcements week 4 7Minister's joint statement 5 18Volunteer system 5S 19Man-power investigation 6 11Prime Minister's broadcast S 11A. I. F. parties to take part 7 13Sir Thomas Blamey's report 8 21Pool unlikely 9 6\" Unity Week\" drive 9 63Rents, re'iew of 2 16Conference held 3a. 13Prime Minister's statement 4 4Conference on control 5 6New regulations announced 9 11Fair Rents Boards 9 12 24IroEx-continued. Issum. PAGE.Rents, review of-continued.Regulations amended 9 12Regulations applied to Australian Capital Territory 13Eviction orders 15 2221 23Application of regulations extended 21 2324 325 21Clerks of courts as agents 26 19Royal Australian Air Force-Queensland training group 2Promotions abroad 3 1217 1119 1421Examination of promotions 303 1123Empire Air Scheme-Promotions 3 13S -Increase in Australian quota 7 3S -Australian officer to observe 8 17S Conference in Canada 29 13.31New Air Observer's School 4 4Overseas head-quarters sanctioned 4 4Officers promoted 4Christmas leave 6 188 1710 13Air support for Army 6 23Army Co-operation School 7 3Awards for gallantry 8 1710 1413 614 615 719 14 18.21 6.22 24 26 0927 23.29 14.32 18.33 734 35 4Tobruk action 8 17Qantas Empire Airways 10 13Women doctors approved 10 13Movements of personnel 10 14Positions in Pacific 11 2United Kingdom bomber squadrons 12 13 6AirTraining Corps 12 20Increased expenditure 12 21Volunteer Air Observers' Corps 13 6Reservists and call-up.. 15 7Assistant-Chief of Staff 15 8Accountancy branch 15 8Gift parcels 17 12Post office in Britain 17 12Army tales over catering 1 14Air ambulance fleet 18 INDEx-continued. IssuE.Royal Australian Air Force-continued.Personnel return from Far East 2124Members of Parliament to assist Minister.. 21Allied war communiques 22Liaison with United States forces 22 24Convoy of Australian Imperial Force 24Umbrella\" for Australia 24Australia badge for personnel overseas 24Age limits raised 24Operational training unit 26Personnel in Iceland 27Dutch squadron formed 27New Chief of Air Staff 28Representative in United States 28Air crews sent to Britain 29Mobile works units 29Need for planes 29Personnel in IndiaPersonnel return from overseas 32Air Board changes 31Assistant Chief of Air Staff 31Merger with United States meteorological service 32Re-organization of control 32Letters from Britain post free 34Judge advocate-general 34Mobile medical units 34Salvage enemy planesAir transport 36Royal Australian Navy-Australians man destroyers 1Leave from Darwin 7Award for good service 7912 14 17 19 21 23 24 27 29 31 32 34Increases in pay 7Flinders Naval Depot leave 8H. M. A. S. Sydney presumed lost 9Replacement of H. M. A. S. Sydney 9Radio stations dealt with 9H. M. A. S. Sydney--details of action 9H. M. A. S. Sydney-dependante' pensions 9H. M. A. S. Parramattato rpedoed 9Presumed loss of H. M. A. S. Perth and H. M. A. S. Yarra 21H. M. A. S. Yarra-survivors 23H. M. A. S. Perth-Enemy report of survivors 34H. M. A. S. Vampire lost..Cable messages to personnel 27 PAGE Iwpnx--Ctinued.Royal Australian Navy-continued.Rear-admiral commanding squadronSecond naval board memberH. M. A. S. Nestor lostDeath sentence on personnelRoyal Commission on Secret Funds--Terms of referenceExtension of terms of reference..Submission of documentsRussia, Aid to-Rolling-stock to IranUse of Australian troopsPrime Minister's statementShipping positionRussia, relations with-National DayMinister's statementAustralian mission deferredExchange of representatives proposedAnglo-Soviet treatyAnniversary of Russo-German warSarawak, H. H. the RajahSecret Funds, Royal Commission on ( ess Royal Commission).Secret sessionSecurity-Appointments announcedQuestioning of Press reporterW omen Peace OfficersS erv ice p a y ra te sIncrease to Navy personnelDependants' allowancesPensions for home forcesPay, allowances, conditionsPayment of Income TaxPension rate for forcesIncome Tax deductionsWar Pensions Entitlement TribunalEligibility for pensionRepatriation committeeSubsistence allow anceState repatriation boardsP en sion s' lia b ilityIncrease in pay and allowancesShips, movement of-Delays not countenancedTerms of settlement of disputeControl of ships takenCoastal Shipping Control BoardPrime Minister invokes NavyUndertaking by unionStevedoring conferenceStevedoring regulationsStevedoring regulations amendedStevedoring commissionCargo control regulations 33 3333 34 36 1-3--4.-3--4--3--9-20 27 313232 10S-6 1332 33 36-3-12 33 12.28 23 2323 24 3528 30 31 32 33 3435 2.. 2 315 15 20 24 29 25 25Issuz. PAOU. 27INDX--con inued. Issun. PAoB.Ships, movement of-continued.Appointment of Judge Clyne 28 22Wharf congestion 29Central Cargo Control Committee 29State Cargo Control Committees 33 14Requisitioned Cargoes Committee 35 8Shipping position 4 13United Staces cargoes 2Q. 22Shipbuilding-Shipyard Unions' deputation 3Marine engines 6 228 12New South Wales activities 6Queensland industry 6 21Cockatoo Dockyard 7 23Naming of cargo vessels 9 12Second stage of programme 12 1633 22Sir Earle Page, M. P. 2 12Status in Great Britain 8 1214 16Social security-Minister's statement 2Tuberculosis patients-allowance to families 4Government's plans for future 8 16Pensioners in employment 10 17Sport in war-time-Prime Minister's statement 821 19Mid-week fixtures 12 8Race meetings 19 2435 17Racecourse for military training.. 21 19Victoria Racing Club 30 24State of the War-Prime Minister's statement 920 823 1926 28 31 331 1832 14Facing 1942 13 11Allied Nations' Declaration 14 3External Affairs' statement 20 9State Parliaments-Question in House 23 17Constitutional reform 23 17Statute of Westminster 6 11Stevens, Sir Bertram 4 16Return to Australia 22 13Superphosphate rationing 5Bounty Bill passed 9Revision of scale 12 17Arrangements for 1942-43 33 14Orders issued 35 24 IND x-cXoeninued. Issus.Supply and Munitions Departments--Definition of functions 2Mr. D. J. Nolan's duties 5Director-General's services terminated 13Tariff-Proposals validated 20Tasmanian war industries-Committee suggested 7Committee to be appointed 8Tea-_ Minister's explanation 3Primo Minister's statement 6Supplies requisitioned 20Effect of control 21Regulations gazetted 23Rationing provisions 24Export prohibited 31Government's purchase of stocks 31Ration coupons-commencement date 32second period 36Control regulations extended 32Rations for troops 33Service in cafes 33Ration for R. A. A. F. and 34Textile trade--Imports to Australia 1Action against hoarding* 9Cotton goods \" frozen\" 10Further stocks \" frozen\" 13Thailand--Proclamation of war 21Thomas and Ratliff 2TinP-roducnti iTn Australia 27Tobacco shortage-Minister to inquire 1Reduced distribution 13Legal control 20Rationing committees 23Deliveries during May 28Deliveries during June 30Deliveries during July 33Deliveries during August 35Production of Australian leaf 30Trades Union Advisory Panel 5Transport-Advisory Board 4Freight savings made 5Regulations made 10Restriction of services 1132Conference held 12Reasonable services 14Director-general appointed 20Holiday transport traffic 22First meeting of board 25Movement of rail traffic 30.34Priority of vehicles 32Pool of road facilities 32 34Commonwealth Railways Commissioner øø 36 PAO. 18 16 2324 1418 311 23 23 22 12 23 16 16 13 324 22 423 23 712 322 724 21 914 12 1217 615-824 16 12 17 17.15 29TNIDHX-OotihaIWd.' rungstic oresUnemployed insurance-Cabinet decisionUniversity students-Report to bo madeMilitary trainingEnrolment restrictedVictoria Cross, award ofConcessions to holders..Vocational training-Ex-members of forcesCabinet decisionSub-committee confers..Report to CabinetVolunteer Defence Corps-Leave of absenceArms and equipmentEquipment distributionFull-time duty personnelCall-up for serviceRegulations announcedPension and compensation rightsAppointment of new commanderGuerilla warfareCommander in QueenslandChief officers--appointments madeBranches in industrial factoriesNo reduction in strengthWar and Conversion Loan-Prime Minister's speechSuccesaful operationWar Cabinet-Appointment madeWar contracts--Royalties on patentsWar HistorianWar industries decentralizationAlbury projectGoulburn factoryWar-New situation-R. A. A. F. takes up positionPartial mobilizationAdditional recruiting of womenPremiers' conferenceEmergency action to be takenMunitions DepartmentPrime Minister's speechWar Cabinet decisionsNew classes for mobilizationR. A. A. F.' s partAircraft production controlPetrol restrictions IsSux. 18 22 451014 17 2..919 2 24610 4 6..10 10 1017 1920 22 2226 29 35 1 17 4 8. 6..24 2..3..l1l I 1 1 11 PAOU. 919 14 12 24 4 8821 16 12 22 616 14 23 11 1113 1322 44422 24 i 1I INDEX-continued. ISSUE. PAGE.War-New situation-continued.Holidays 11 1112 31313 14L: 160o. 1i 21 824 13S. 25 1829 133033 3Urgent defence measures 11 11Restriction of transport services 11 12Special powers to Premiers 11 12Air Raid Precautions II 1212 7Employment of women 11 13G. P. O. plans 11 13Late shopping 11 1312 7Prime Ministers speech to Houso 11Special war taxes 11Emergency food stocks 12 322 21Primary industries 12 7Empire Air Service 12 8Mid-week sport 12 8Prime Minister's broadcast 13 7Pacific unity of command 14 418 11Emergency broadcasting 14 415 1220 6Allied war planning 15 1227 1731 7Unity with Britain 17 1421 9Empire War Cabinet 17 14Pacific War Council at London 17II Aids to enemy regulated 17 21 9Radium control 17Prime Minister's speech on Liberty Loan 18 4Australian Military Forces call-up 18 11Emergency control, regulations 18 1120 3Contracts adjustment 18 12Allied Works Council 18 13 6S. 21 05 1931 7compensation 36Total mobilization 18 13Call-up under total mobilization 21 6S. 25Restriction on telephones 18 14National Economic Plan 18 14External Affairs statement 20 4Advertising 21Total mobilization-Compulsory civil defence duties 22 22Priorities of Commonwealth works 22 23Local government elections 22 24Holiday transport traffic 22 24 INDEx-confued.War-New situation-confinued.Pacific War Council at WashingtonCivil servants from Papua and New GuineaImmobilization of small craftEmergency communications serviceDamage to Property.Civilians, kiled or injuredProvisional cover-propertyPersonnel of CommissionOperation of schemeDamage to State propertyRates announcedCompanies' services freeDamage to telephone apparatus..Cargo insuranceWar Savings CertificatesWar-time Profits Tax-Proposed committeeWestern Australian war industrie.Report publishedExpansion Commission..Terms of referenceWheat agreement, International-Conference at WashingtonApproval by governmentsWheat Board, Australian-Minister perturbedAdditional membersAdditional appointments madeFurther appointment.Reduction of personnel* Wheat pools payments-Further advanceAdvance approvedForthcoming harvest1941-42 crop, first advanceGuaranteed priceFFourrmth eorf ppaayymmeennttI Wheat Stabilization Scheme-Minister's statementPosition of share-farmersBreaches of regulationsCrop seasonRestrictions on acreage -WesternAutaiElimination of marginal areasWine industry-Deputation to Minister..Relaxation of embargo..Levy reducedWomen, Nationality of-Australian women marrying Americans ISSUE. 24 27-32 33 1229 1214 13 1315 19 19 23 34.34 2. 3. 6.31 3. 4 628 3.4. 6.29 33 8.1421 23 26 36 421.34 24 PAGE. 32INDEX-contine4d. ISSUE. PAGEWomen's war organizations-V. A. D. Officers 2 12Service Ministers' statements 2 13Prime Minister's statement 2 12Qualifications for appointment 3 8W. A. A. A. F. 3 98 9S 31 6Pay of Nursing Services and Auxiliariea 3 9Recruitment by the Army 4 9Australian Women's Army Service 5 18 917 9S. 21 2424 22S. 27 23.31 634 13V. A. D.' a for overseas 5 1829 19Women telegraphists 6 13Pathology courses for women 8 8Wearing of uniforms 8 9Additional recruiting 11 3A. W. A. S. conditions and pay 12 16Nurse's rankings 17 9Compensation for \" immobile\" Voluntary Aid Detachments 19 4Women doctors 19 433 7Married nurses 32 22Subsistence allowance 33 7V. A. D. controller 33 7Deputy. diretor of W. A. A. A. P. 35 17Public Service typists desiring to enlist 36Wool agreement.. 3 8Review not made 8 11Central Wool Committee chairman 28 22Review made-Price increase.. 30 9Disposal of profits 33 23Australian Wool Board 33 23Regulations amended 34 244Wool packs for 1942-43 clip 36 16Wool sales to United States of America-2 6Price of strategic storages 6 IYugo-slav Battalion 4 16 . IBy Authority: L. F. JOHNSTON, Commonwealth Government Printer, Canberra."}}